---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHookType.IsOffsetLengthRequired
source: html/4a11667a-73c9-a7a7-83a7-799cc45df5c2.htm
---
# Autodesk.Revit.DB.Structure.RebarHookType.IsOffsetLengthRequired Method

Check whether hook offset length is required.
 remarks: If hook angle is no more than 90 degree, hook offset length is not meaningful.
 returns: True if hook offset length is required, otherwise false.

## Syntax (C#)
```csharp
public bool IsOffsetLengthRequired()
```